# Aggregates in Pandas
## Introduction

This lesson you will learn about <i>aggregates</i> in Pandas. An <i>aggregate</i> statistic is a way of creating a single number that describes a group of numbers. Common aggregate statistics include mean, median, or standard deviation.<br>
<br>
You will also learn how to rearrange a DataFrame into a <i>pivot table</i>, which is a great way to compare data across two dimensions.

## Calculating Column Statistics

In the previous lesson, you learned how to perform operations on each value in a column using apply.<br>
<br>
In this exercise, you will learn how to combine all of the values from a column for a single calculation.<br>
<br>
Some examples of this type of calculation include:<br>

* The DataFrame customers contains the names and ages of all of your customers. You want to find the median age:<br>
    `print(customers.age)`<br>
    `>> [23, 25, 31, 35, 35, 46, 62]`<br>
    `print(customers.age.median())`<br>
    `>> 35`<br>
<br>
* The DataFrame shipments contains address information for all shipments that you’ve sent out in the past year. You want to know how many different states you have shipped to (and how many shipments went to the same state):<br>
    `print(shipments.state)`<br>
    `>> ['CA', 'CA', 'CA', 'CA', 'NY', 'NY', 'NJ', 'NJ', 'NJ', 'NJ', 'NJ', 'NJ', 'NJ']`<br>
    `print(shipments.state.nunique())`<br>
    `>> 3`<br>
<br>
* The DataFrame inventory contains a list of types of t-shirts that your company makes. You want a list of the colors that your shirts come in:<br>
    `print(inventory.color)`<br>
    `>> ['blue', 'blue', 'blue', 'blue', 'blue', 'green', 'green', 'orange', 'orange', 'orange']`<br>
    `print(inventory.color.unique())`<br>
    `>> ['blue', 'green', 'orange']`<br>

The general syntax for these calculations is:<br>
<br>
`df.column_name.command()`<br>
<br>
The following table summarizes some common commands:<br>

|Command|Description|
|:------|:----------|
|`mean`|Average of all values in column|
|`std`|Standard deviation|
|`median`|Median|
|`max`|Maximum value in column|
|`min`|Minimum value in column|
|`count`|Number of values in column|
|`nunique`|Number of unique values in column|
|`unique`|List of unique values in column|

1. Once more, we'll revisit our orders from ShoeFly.com. Our new batch of orders is in the DataFrame `orders`. Examine the first 10 rows of the DataFrame

In [1]:
import pandas as pd

orders = pd.read_csv('orders.csv')

orders.head(10)

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,price
0,97916,Douglas,Perez,DouglasPerez28@gmail.com,stilettos,fabric,brown,90
1,67691,Tiffany,O'neill,TiffanyO'neill51@gmail.com,wedges,leather,navy,94
2,72818,Susan,Rivas,Susan.Rivas@gmail.com,sandals,faux-leather,white,96
3,28080,Angela,Hopper,AngelaHopper62@outlook.com,stilettos,leather,red,96
4,89958,Thomas,Benjamin,TBenjamin1981@gmail.com,sandals,faux-leather,navy,97
5,11853,Jonathan,Park,JP1285@gmail.com,wedges,fabric,white,98
6,73682,Christine,Adkins,ChristineAdkins83@gmail.com,stilettos,faux-leather,red,99
7,52634,Cynthia,Tanner,CTanner1976@gmail.com,stilettos,faux-leather,navy,99
8,33847,Walter,Fitzgerald,WalterFitzgerald65@gmail.com,ballet flats,leather,white,101
9,25964,Carl,Garcia,CarlGarcia53@gmail.com,wedges,faux-leather,white,101

2. Our finance department wants to know the price of the most expensive pair of shoes purchased. Save your answer to the variable `most_expensive.`

In [2]:
most_expensive = orders.price.max()

most_expensive

498

3. Our fashion department wants to know how many different colors of shoes we are selling. Save your answer to the variable `num_colors`.

In [3]:
num_colors = orders.shoe_color.nunique()

num_colors

5

***

## Calculating Aggregate Functions I

When we have a bunch of data, we often want to calculate aggregate statistics (mean, standard deviation, median, percentiles, etc.) over certain subsets of the data.<br>
<br>
Suppose we have a grade book with columns `student`, `assignment_name`, and `grade`. The first few lines look like this:<br>

|student|assignment_name|grade|
|:------|:--------------|:----|
|Amy|Assignment 1|75|
|Amy|Assignment 2|35|
|Bob|Assignment 1|99|
|Bob|Assignment 2|35|
|...||

We want to get an average grade for each student across all assignments. We could do some sort of loop, but Pandas gives us a much easier option: the method `.groupby`.<br>
<br>
For this example, we'd use the following command:<br>
<br>
`grades = df.groupby('student').grade.mean()`<br>
<br>
The output might look something like this:<br>

|student|grade|
|:------|:----|
|Amy|80|
|Bob|90|
|Chris|75|
|…||
	
In general, we use the following syntax to calculate aggregates:<br>
<br>
`df.groupby('column1').column2.measurement()`<br>
<br>
where:<br>
* `column1` is the column that we want to group by (`'student'` in our example)
* `column2` is the column that we want to perform a measurement on (`grade` in our example)
* `measurement` is the measurement function we want to apply (`mean` in our example)

1. Let's return to our orders data from ShoeFly.com.<br>
<br>
In the previous exercise, our finance department wanted to know the most expensive shoe that we sold.<br>
<br>
Now, they want to know the most expensive shoe for each `shoe_type` (i.e., the most expensive boot, the most expensive ballet flat, etc.).<br>
<br>
Save your answer to the variable `pricey_shoes`.

In [4]:
pricey_shoes = orders.groupby('shoe_type').price.max()

pricey_shoes

shoe_type
ballet flats    498
sandals         498
stilettos       468
wedges          488
Name: price, dtype: int64

2. What type of object is `pricey_shoes`?

In [5]:
print(type(pricey_shoes))

<class 'pandas.core.series.Series'>

***

## Calculating Aggregate Functions II

After using `groupby`, we often need to clean our resulting data.<br>
<br>
As we saw in the previous exercise, the groupby function creates a new Series, not a DataFrame. For our ShoeFly.com example, the indices of the Series were different values of `shoe_type`, and the name property was `price`.<br>
<br>
Usually, we'd prefer that those indices were actually a column. In order to get that, we can use `reset_index()`. This will transform our Series into a DataFrame and move the indices into their own column.<br>
<br>
Generally, you'll always see a `groupby` statement followed `by reset_index`:<br>
<br>
`df.groupby('column1').column2.measurement().reset_index()`<br>
<br>
When we use groupby, we often want to rename the column we get as a result. For example, suppose we have a DataFrame `teas` containing data on types of tea:<br>

|id|tea|category|caffeine|price|
|:-|:--|:-------|:-------|:----|
|0|earl grey|black|38|3|
|1|english breakfast|black|41|3|
|2|irish breakfast|black|37|2.5|
|3|jasmine|green|23|4.5|
|4|matcha|green|48|5|
|5|camomile|herbal|0|3|
|…|||

We want to find the number of each category of tea we sell. We can use:<br>
<br>
`teas_counts = teas.groupby('category').id.count().reset_index()`<br>
<br>
This yields a DataFrame that looks like:<br>

| |category|id|
|-|:-------|:-|
|0|black|3|
|1|green|4|
|2|herbal|8|
|3|white|2|
|…|	|
	
The new column contains the counts of each category of tea sold. We have 3 black teas, 4 green teas, and so on. However, this column is called `id` because we used the `id` column of teas to calculate the counts. We actually want to call this column `counts`. Remember that we can rename columns:<br>
<br>
`teas_counts = teas_counts.rename(columns={"id": "counts"})`<br>
<br>
Our DataFrame now looks like:

| |category|counts|
|-|:-------|:-----|
|0|black|3|
|1|green|4|
|2|herbal|8|
|3|white|2|
|…|	|

1. Modify your code from the previous exercise so that it ends with `reset_index`, which will change `pricey_shoes` into a DataFrame.

In [6]:
orders = pd.read_csv('orders.csv')

pricey_shoes = orders.groupby('shoe_type').price.max().reset_index()

pricey_shoes

      shoe_type  price
0  ballet flats    498
1       sandals    498
2     stilettos    468
3        wedges    488

2. Now, what type of object is `pricey_shoes`?

In [7]:
print(type(pricey_shoes))

<class 'pandas.core.frame.DataFrame'>

***

## Calculating Aggregate Functions III

Sometimes, the operation that you want to perform is more complicated than `mean` or `count`. In those cases, you can use the `apply` method and lambda functions, just like we did for individual column operations. Note that the input to our lambda function will always be a list of values.<br>
<br>
A great example of this is calculating percentiles. Suppose we have a DataFrame of employee information called `df` that has the following columns:<br>
* `id`: the employee's id number
* `name`: the employee's name
* `wage`: the employee's hourly wage
* `category`: the type of work that the employee does

Our data might look something like this:<br>

|id|name|wage|category|
|:-|:---|:---|:-------|
|10131|Sarah Carney|39|product|
|14189|Heather Carey|17|design|
|15004|Gary Mercado|33|marketing|
|11204|Cora Copaz|27|design|
|…||||

If we want to calculate the 75th percentile (i.e., the point at which 75% of employees have a lower wage and 25% have a higher wage) for each `category`, we can use the following combination of apply and a lambda function:<br>
<br>
`# np.percentile can calculate any percentile over an array of values`<br>
`high_earners = df.groupby('category').wage`<br>
    `.apply(lambda x: np.percentile(x, 75))`<br>
    `.reset_index()`<br>
<br>
The output, `high_earners` might look like this:<br>

| |category|wage|
|-|:-------|:---|
|0|design|23|
|1|marketing|35|
|2|product|48|
|…|||

1. Once more, we'll return to the data from ShoeFly.com. Our Marketing team says that it's important to have some affordably priced shoes available for every color of shoe that we sell.<br>
<br>
Let's calculate the 25th percentile for shoe price for each `shoe_color` to help Marketing decide if we have enough cheap shoes on sale. Save the data to the variable `cheap_shoes`.<br>
<br>
<b>Note</b>: Be sure to use `reset_index()` at the end of your query so that `cheap_shoes` is a DataFrame.

In [8]:
import numpy as np

orders = pd.read_csv('orders.csv')

cheap_shoes = orders.groupby('shoe_color').price\
    .apply(lambda x: np.percentile(x, 25))\
    .reset_index()

cheap_shoes

  shoe_color  price
0      black  130.0
1      brown  248.0
2       navy  200.0
3        red  157.0
4      white  188.0

***

## Calculating Aggregate Functions IV

Sometimes, we want to group by more than one column. We can easily do this by passing a list of column names into the `groupby` method.<br>
<br>
Imagine that we run a chain of stores and have data about the number of sales at different locations on different days:<br>

|Location|Date|Day of Week|Total Sales|
|:-------|:---|:----------|:----------|
|West Village|February 1|W|400|
|West Village|February 2|Th|450|
|Chelsea|February 1|W|375|
|Chelsea|February 2|Th|390|
		
We suspect that sales are different at different locations on different days of the week. In order to test this hypothesis, we could calculate the average sales for each store on each day of the week across multiple months. The code would look like this:<br>
<br>
`df.groupby(['Location', 'Day of Week'])['Total Sales'].mean().reset_index()`<br>
<br>
The results might look something like this:

|Location|Day of Week|Total Sales|
|:-------|:----------|:----------|
|Chelsea|M|402.50|
|Chelsea|Tu|422.75|
|Chelsea|W|452.00|
|…|

1. At ShoeFly.com, our Purchasing team thinks that certain `shoe_type`/`shoe_color` combinations are particularly popular this year (for example, blue ballet flats are all the rage in Paris).<br>
<br>
Create a DataFrame with the total number of shoes of each `shoe_type`/`shoe_color` combination purchased. Save it to the variable `shoe_counts`.<br>
<br>
You should be able to do this using `groupby` and `count()`.<br>
<br>
Note: When we're using `count()`, it doesn't really matter which column we perform the calculation on. You should use `id` in this example, but we would get the same answer if we used shoe_type or `last_name`.<br>
<br>
Remember to use `reset_index()` at the end of your code!<br>

In [9]:
shoe_counts = orders.groupby(['shoe_type', 'shoe_color']).id.count().reset_index()

shoe_counts

       shoe_type shoe_color  id
0   ballet flats      black   2
1   ballet flats      brown  11
2   ballet flats       navy  17
3   ballet flats        red  13
4   ballet flats      white   7
5        sandals      black   3
6        sandals      brown  10
7        sandals       navy  13
8        sandals        red  14
9        sandals      white  10
10     stilettos      black   8
11     stilettos      brown  14
12     stilettos       navy   7
13     stilettos        red  16
14     stilettos      white   5
15        wedges      brown  13
16        wedges       navy  16
17        wedges        red   4
18        wedges      white  17

***

## Pivot Tables

When we perform a groupby across multiple columns, we often want to change how our data is stored. For instance, recall the example where we are running a chain of stores and have data about the number of sales at different locations on different days:

|Location|Date|Day of Week|Total Sales|
|:-------|:---|:----------|:----------|
|West Village|February 1|W|400|
|West Village|February 2|Th|450|
|Chelsea|February 1|W|375|
|Chelsea|February 2|Th|390|

We suspected that there might be different sales on different days of the week at different stores, so we performed a `groupby` across two different columns (`Location` and `Day of Week`). This gave us results that looked like this:

|Location|Day of Week|Total Sales|
|:-------|:----------|:----------|
|Chelsea|M|300|
|Chelsea|Tu|310|
|Chelsea|W|320|
|Chelsea|Th|290|
|…|||
|West Village|Th|400|
|West Village|F|390|
|West Village|Sa|250|
|…|||

In order to test our hypothesis, it would be more useful if the table was formatted like this:

|Location|M|Tu|W|Th|F|Sa|Su|
|:-------|:|:-|:|:-|:|:-|:-|
|Chelsea|400|390|250|275|300|150|175|
|West Village|300|310|350|400|390|250|200|
|…||||||||						

Reorganizing a table in this way is called <b>pivoting</b>. The new table is called a <b>pivot table</b>.<br>
<br>
In Pandas, the command for pivot is:<br>

`df.pivot(columns='ColumnToPivot',`<br>
         `index='ColumnToBeRows',`<br>
         `values='ColumnToBeValues')`<br>
<br>
For our specific example, we would write the command like this:<br>
<br>
`# First use the groupby statement:`<br>
`unpivoted = df.groupby(['Location', 'Day of Week'])['Total Sales'].mean().reset_index()`<br>
`# Now pivot the table`<br>
`pivoted = unpivoted.pivot(`<br>
     `columns='Day of Week',`<br>
     `index='Location',`<br>
     `values='Total Sales')`<br>
<br>
Just like with `groupby`, the output of a pivot command is a new DataFrame, but the indexing tends to be "weird", so we usually follow up with <b>`.reset_index()`</b>.

1. In the previous example, you created a DataFrame with the total number of shoes of each `shoe_type`/`shoe_color` combination purchased for ShoeFly.com.<br>
<br>
The purchasing manager complains that this DataFrame is confusing.<br>
<br>
Make it easier for her to compare purchases of different shoe colors of the same shoe type by creating a pivot table. Save your results to the variable `shoe_counts_pivot`.<br>
<br>
Your table should look like this:<br>

|shoe_type|black|brown|navy|red|white|
|:--------|:----|:----|:---|:--|:----|
|ballet flats|…|…|…|…|…|
|sandals|…|…|…|…|…|
|stilettos|…|…|…|…|…|
|wedges|…|…|…|…|…|

Remember to use `reset_index()` at the end of your code!

In [10]:
shoe_counts_pivot = shoe_counts.pivot(
    columns='shoe_color',
    index='shoe_type',
    values='id')

shoe_counts_pivot

shoe_color    black  brown  navy   red  white
shoe_type
ballet flats    2.0   11.0  17.0  13.0    7.0
sandals         3.0   10.0  13.0  14.0   10.0
stilettos       8.0   14.0   7.0  16.0    5.0
wedges          NaN   13.0  16.0   4.0   17.0

***

# Review

This lesson introduced you to aggregates in Pandas. You learned:

* How to perform <i>aggregate<i> statistics over individual rows with the same value using `groupby`.
* How to rearrange a DataFrame into a <i>pivot</i> table, a great way to compare data across two dimensions.

1. Let's examine some more data from ShoeFly.com. This time, we'll be looking at data about user visits to the website (the same dataset that you saw in the introduction to this lesson).<br>
The data is a DataFrame called `user_visits`. Use `print()` and `head()` to examine the first few rows of the DataFrame.

In [11]:
user_visits = pd.read_csv('page_visits.csv')

user_visits.head()

,id,first_name,last_name,email,month,utm_source
0,10043,Louis,Koch,LouisKoch43@gmail.com,3 - March,yahoo
1,10150,Bruce,Webb,BruceWebb44@outlook.com,3 - March,twitter
2,10155,Nicholas,Hoffman,Nicholas.Hoffman@gmail.com,2 - February,google
3,10178,William,Key,William.Key@outlook.com,3 - March,yahoo
4,10208,Karen,Bass,KB4971@gmail.com,2 - February,google

2. The column `utm_source` contains information about how users got to ShoeFly's homepage. For instance, if `utm_source = Facebook`, then the user came to ShoeFly by clicking on an ad on Facebook.com.<br>
Use a `groupby statement` to calculate how many visits came from each of the different sources. Save your answer to the variable `click_source`.<br>
<br>
Remember to use reset_index()!

In [12]:
click_source = user_visits.groupby('utm_source').id.count().reset_index()

click_source

  utm_source   id
0      email  462
1   facebook  823
2     google  543
3    twitter  415
4      yahoo  757

3. Our Marketing department thinks that the traffic to our site has been changing over the past few months. Use `groupby` to calculate the number of visits to our site 
from each `utm_source` for each month. Save your answer to the variable `click_source_by_month`.

In [14]:
click_source_by_month = user_visits.groupby(['utm_source', 'month']).id.count().reset_index()

click_source_by_month

   utm_source         month   id
0       email   1 - January   43
1       email  2 - February  147
2       email     3 - March  272
3    facebook   1 - January  404
4    facebook  2 - February  263
5    facebook     3 - March  156
6      google   1 - January  127
7      google  2 - February  196
8      google     3 - March  220
9     twitter   1 - January  164
10    twitter  2 - February  154
11    twitter     3 - March   97
12      yahoo   1 - January  262
13      yahoo  2 - February  240
14      yahoo     3 - March  255

5. The head of Marketing is complaining that this table is hard to read. Use `pivot` to create a pivot table where the rows are `utm_source` and the columns are `month`. Save your results to the variable `click_source_by_month_pivot`.<br>
It should look something like this:

|utm_source|1 - January|2 - February|3 - March|
|:---------|:----------|:-----------|:--------|
|email|…|…|…|
|facebook|…|…|…|
|google|…|…|…|
|twitter|…|…|…|
|yahoo|…|…|…|

In [16]:
click_source_by_month_pivot = click_source_by_month.pivot(
    columns='month',
    index='utm_source',
    values='id')

click_source_by_month_pivot

month       1 - January  2 - February  3 - March
utm_source
email                43           147        272
facebook            404           263        156
google              127           196        220
twitter             164           154         97
yahoo               262           240        255